# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'buo/cask-upgrade'

# Unix
brew 'zsh'
brew 'bash'
brew 'fish'
brew 'coreutils'
brew 'gmp'
brew 'gnu-sed'
brew 'grep'
brew 'gzip'
brew 'tmux'
brew 'vim'

# Binaries
brew 'bat'
brew 'ctags'
brew 'dmg2img'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'git-extras'
brew 'gh'
brew 'hub'
brew 'jq'
brew 'lynx'
brew 'mas'
brew 'pinentry-mac'
brew 'ripgrep'
brew 'tesseract'
brew 'the_silver_searcher'
brew 'thefuck'
brew 'tldr'
brew 'wget'
brew 'z'

# Pen Test
brew 'hydra'
brew 'john'
brew 'nmap'
brew 'socat'
brew 'sqlmap'

# Developer
brew 'nvm'
brew 'yarn'
brew 'python'
brew 'ruby'
brew 'perl'
brew 'php'
brew 'go'
brew 'rustup-init'
brew 'gcc'
brew 'cmake'
brew 'vips'
brew 'mysql'
brew 'postgresql'
brew 'redis'
cask 'adoptopenjdk8'
brew 'elasticsearch'
brew 'diff-so-fancy'
brew 'neovim', args: ['HEAD']

# Cli Tools
brew 'awscli'
brew 'broot'
brew 'cmatrix'
brew 'dasht'
brew 'gatsby-cli'
brew 'gotop'
brew 'imagemagick'
brew 'lazygit'
brew 'navi'
brew 'neofetch'
brew 'neomutt'
brew 'nnn'
brew 'pstree'
brew 'silicon'
brew 'speedtest-cli'
brew 'streamlink'
brew 'task'
brew 'tree'
brew 'wallpaper'
brew 'weechat'
brew 'xdotool'
brew 'youtube-dl'

brew 'dbus'
# tap 'zegervdv/zathura'
# brew 'girara', args: ['HEAD']
# brew 'zathura', args: ['HEAD', 'with-synctex']
# brew 'zathura-pdf-poppler'

# Applications
# cask 'adobe-creative-cloud'
cask 'alacritty'
cask 'alfred'
cask 'bartender'
cask 'cheatsheet'
cask 'dash'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'focus'
cask 'ghidra'
cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iina'
cask 'imageoptim'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'little-snitch'
cask 'mactex'
cask 'obs'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Fonts
cask 'font-fira-code-nerd-font'
cask 'font-hack-nerd-font'

# Mac App Store
mas 'Xcode', id: 497799835
