# Taps
tap 'homebrew/core'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

# Unix
brew 'zsh'
brew 'bash'
brew 'fish'
brew 'grep'
brew 'tmux'
brew 'vim'

# Binaries
brew 'bat'
brew 'ctags'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'gh'
brew 'hub'
brew 'mas'
brew 'navi'
brew 'ripgrep'
brew 'thefuck'
brew 'tldr'

# Pen Test
brew 'nmap'
brew 'sqlmap'

# Developer
brew 'nvm'
brew 'yarn'
brew 'python'
brew 'ruby'
brew 'php'
brew 'go'
brew 'mysql'
brew 'postgresql'
brew 'redis'
cask 'adoptopenjdk8'
brew 'elasticsearch'
brew 'diff-so-fancy'
brew 'neovim'
brew 'awscli'

# Cli Tools
brew 'broot'
brew 'cmatrix'
brew 'gotop'
brew 'imagemagick'
brew 'neofetch'
brew 'nnn'
brew 'speedtest-cli'
brew 'task'
brew 'tree'

# Applications
cask 'alfred'
cask 'bartender'
cask 'cheatsheet'
cask 'discord'
cask 'docker'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'gimp'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite-no-mail'
cask 'iina'
cask 'imageoptim'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'java'
cask 'karabiner-elements'
cask 'keepassxc'
cask 'little-snitch'
cask 'obs'
cask 'rectangle'
cask 'slack'
cask 'spotify'
cask 'the-unarchiver'
cask 'transmission'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'visual-studio-code'

# Fonts
cask 'font-fira-code'
cask 'font-hack-nerd-font'

# Mac App Store
mas 'Xcode', id: 497799835
